chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D44.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MPDDRC</name>
      <version>11043Y</version>
      <description>AHB Multiport DDR-SDRAM Controller</description>
      <groupName>EBI</groupName>
      <prependToName>MPDDRC_</prependToName>
      <baseAddress>0xF0010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MR</name>
          <description>MPDDRC Mode Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>MPDDRC Command Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_CMD</name>
                  <description>Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOP_CMD</name>
                  <description>The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRCGALL_CMD</name>
                  <description>The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMR_CMD</name>
                  <description>The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFSH_CMD</name>
                  <description>The MPDDRC issues an Auto-Refresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_LMR_CMD</name>
                  <description>The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_MD</name>
                  <description>Deep Power mode: Access to Deep Powerdown mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDDR2_CMD</name>
                  <description>The MPDDRC issues an LPDDR2 Mode Register command when the device is accessed regardless of the cycle. To activate this mode, the Mode Register command must be followed by a write to the low-power DDR2-SDRAM.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRS</name>
              <description>Mode Register Select LPDDR2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTR</name>
          <description>MPDDRC Refresh Timer Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x03000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <description>MPDDRC Refresh Timer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADJ_REF</name>
              <description>Adjust Refresh Rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_PB</name>
              <description>Refresh Per Bank</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MR4_VALUE</name>
              <description>Content of MR4 Register (read-only)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>MPDDRC Configuration Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00207024</resetValue>
          <fields>
            <field>
              <name>NC</name>
              <description>Number of Column Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>9_COL_BITS</name>
                  <description>9 bits to define the column number, up to 512 columns</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_COL_BITS</name>
                  <description>10 bits to define the column number, up to 1024 columns</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11_COL_BITS</name>
                  <description>11 bits to define the column number, up to 2048 columns</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_COL_BITS</name>
                  <description>12 bits to define the column number, up to 4096 columns</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NR</name>
              <description>Number of Row Bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>11_ROW_BITS</name>
                  <description>11 bits to define the row number, up to 2048 rows</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_ROW_BITS</name>
                  <description>12 bits to define the row number, up to 4096 rows</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13_ROW_BITS</name>
                  <description>13 bits to define the row number, up to 8192 rows</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14_ROW_BITS</name>
                  <description>14 bits to define the row number, up to 16384 rows</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS Latency</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR_CAS2</name>
                  <description>LPDDR1 CAS Latency 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR_CAS3</name>
                  <description>DDR2/LPDDR2/LPDDR1 CAS Latency 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLL</name>
              <description>Reset DLL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_DISABLED</name>
                  <description>Disable DLL reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_ENABLED</name>
                  <description>Enable DLL reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIC_DS</name>
              <description>Output Driver Impedance Control (Drive Strength)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR2_NORMALSTRENGTH</name>
                  <description>Normal drive strength (DDR2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_WEAKSTRENGTH</name>
                  <description>Weak drive strength (DDR2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS_DLL</name>
              <description>DISABLE DLL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZQ</name>
              <description>ZQ Calibration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Calibration command after initialization</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LONG</name>
                  <description>Long calibration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHORT</name>
                  <description>Short calibration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>ZQ Reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCD</name>
              <description>Off-chip Driver</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR2_EXITCALIB</name>
                  <description>Exit from OCD Calibration mode and maintain settings</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_DEFAULT_CALIB</name>
                  <description>OCD calibration default</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQMS</name>
              <description>Mask Data is Shared</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SHARED</name>
                  <description>DQM is not shared with another controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED</name>
                  <description>DQM is shared with another controller</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENRDM</name>
              <description>Enable Read Measure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>DQS/DDR_DATA phase error correction is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>DQS/DDR_DATA phase error correction is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC_LPDDR1</name>
              <description>Low-cost Low-power DDR1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_2_BANKS</name>
                  <description>Any type of memory devices except of low cost, low density Low Power DDR1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BANKS_LPDDR1</name>
                  <description>Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 "MPDDRC Memory Device Register").The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB</name>
              <description>Number of Banks</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_BANKS</name>
                  <description>4-bank memory devices</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BANKS</name>
                  <description>8 banks. Only possible when using the DDR2-SDRAM and low-power DDR2-SDRAM devices.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDQS</name>
              <description>Not DQS</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Not DQS is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Not DQS is disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECOD</name>
              <description>Type of Decoding</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQUENTIAL</name>
                  <description>Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVED</name>
                  <description>Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNAL</name>
              <description>Support Unaligned Access</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSUPPORTED</name>
                  <description>Unaligned access is not supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Unaligned access is supported.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR0</name>
          <description>MPDDRC Timing Parameter 0 Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20227225</resetValue>
          <fields>
            <field>
              <name>TRAS</name>
              <description>Active to Precharge Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCD</name>
              <description>Row to Column Delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWR</name>
              <description>Write Recovery Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRC</name>
              <description>Row Cycle Delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP</name>
              <description>Row Precharge Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRRD</name>
              <description>Active BankA to Active BankB</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWTR</name>
              <description>Internal Write to Read Delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMRD</name>
              <description>Load Mode Register Command to Activate or Refresh Command</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR1</name>
          <description>MPDDRC Timing Parameter 1 Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x03C80808</resetValue>
          <fields>
            <field>
              <name>TRFC</name>
              <description>Row Cycle Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSNR</name>
              <description>Exit Self-refresh Delay to Non-Read Command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSRD</name>
              <description>Exit Self-refresh Delay to Read Command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXP</name>
              <description>Exit Powerdown Delay to First Command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
