chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D44.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SHA</name>
      <version>6156M</version>
      <description>Secure Hash Algorithm</description>
      <prependToName>SHA_</prependToName>
      <baseAddress>0xFC050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SHA</name>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Processing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FIRST</name>
              <description>First Block of a Message</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUIHV</name>
              <description>Write User Initial Hash Values</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>SMOD</name>
              <description>Start Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL_START</name>
                  <description>Manual Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_START</name>
                  <description>Auto Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDATAR0_START</name>
                  <description>SHA_IDATAR0 access only Auto Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROCDLY</name>
              <description>Processing Delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHORTEST</name>
                  <description>SHA processing runtime is the shortest one</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LONGEST</name>
                  <description>SHA processing runtime is the longest one (reduces the SHA bandwidth requirement, reduces the system bus overload)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UIHV</name>
              <description>User Initial Hash Values</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGO</name>
              <description>SHA Algorithm</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHA1</name>
                  <description>SHA1 algorithm processed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA256</name>
                  <description>SHA256 algorithm processed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA384</name>
                  <description>SHA384 algorithm processed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA512</name>
                  <description>SHA512 algorithm processed</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA224</name>
                  <description>SHA224 algorithm processed</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUALBUFF</name>
              <description>Dual Input Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URAT</name>
              <description>Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>IDATAR[%s]</name>
          <description>Input Data 0 Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Input Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>IODATAR[%s]</name>
          <description>Input/Output Data 0 Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IODATA</name>
              <description>Input/Output Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
