chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D44.xml
        <register>
          <name>REM11_7</name>
          <description>PMECC Remainder 11 Register (sec_num = 7)</description>
          <addressOffset>0x0000049C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELCFG</name>
          <description>PMECC Error Location Configuration Register</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECTORSZ</name>
              <description>Sector Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRNUM</name>
              <description>Number of Errors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELPRIM</name>
          <description>PMECC Error Location Primitive Register</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000401A</resetValue>
          <fields>
            <field>
              <name>PRIMITIV</name>
              <description>Primitive Polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELEN</name>
          <description>PMECC Error Location Enable Register</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENINIT</name>
              <description>Error Location Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELDIS</name>
          <description>PMECC Error Location Disable Register</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DIS</name>
              <description>Disable Error Location Engine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELSR</name>
          <description>PMECC Error Location Status Register</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Error Location Engine Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIER</name>
          <description>PMECC Error Location Interrupt Enable register</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIDR</name>
          <description>PMECC Error Location Interrupt Disable Register</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIMR</name>
          <description>PMECC Error Location Interrupt Mask Register</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELISR</name>
          <description>PMECC Error Location Interrupt Status Register</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CNT</name>
              <description>Error Counter value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA0</name>
          <description>PMECC Error Location SIGMA 0 Register</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SIGMA0</name>
              <description>Coefficient of degree 0 in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA1</name>
          <description>PMECC Error Location SIGMA 1 Register</description>
          <addressOffset>0x0000052C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA1</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA2</name>
          <description>PMECC Error Location SIGMA 2 Register</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA2</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA3</name>
          <description>PMECC Error Location SIGMA 3 Register</description>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA3</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA4</name>
          <description>PMECC Error Location SIGMA 4 Register</description>
          <addressOffset>0x00000538</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA4</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA5</name>
          <description>PMECC Error Location SIGMA 5 Register</description>
          <addressOffset>0x0000053C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA5</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA6</name>
          <description>PMECC Error Location SIGMA 6 Register</description>
          <addressOffset>0x00000540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA6</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA7</name>
          <description>PMECC Error Location SIGMA 7 Register</description>
          <addressOffset>0x00000544</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA7</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA8</name>
          <description>PMECC Error Location SIGMA 8 Register</description>
          <addressOffset>0x00000548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA8</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA9</name>
          <description>PMECC Error Location SIGMA 9 Register</description>
          <addressOffset>0x0000054C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA9</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA10</name>
          <description>PMECC Error Location SIGMA 10 Register</description>
          <addressOffset>0x00000550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA10</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA11</name>
          <description>PMECC Error Location SIGMA 11 Register</description>
          <addressOffset>0x00000554</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA11</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA12</name>
          <description>PMECC Error Location SIGMA 12 Register</description>
          <addressOffset>0x00000558</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA12</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA13</name>
          <description>PMECC Error Location SIGMA 13 Register</description>
          <addressOffset>0x0000055C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA13</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA14</name>
          <description>PMECC Error Location SIGMA 14 Register</description>
          <addressOffset>0x00000560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA14</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA15</name>
          <description>PMECC Error Location SIGMA 15 Register</description>
          <addressOffset>0x00000564</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA15</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA16</name>
          <description>PMECC Error Location SIGMA 16 Register</description>
          <addressOffset>0x00000568</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA16</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA17</name>
          <description>PMECC Error Location SIGMA 17 Register</description>
          <addressOffset>0x0000056C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA17</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA18</name>
          <description>PMECC Error Location SIGMA 18 Register</description>
          <addressOffset>0x00000570</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA18</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA19</name>
          <description>PMECC Error Location SIGMA 19 Register</description>
          <addressOffset>0x00000574</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA19</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA20</name>
          <description>PMECC Error Location SIGMA 20 Register</description>
          <addressOffset>0x00000578</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA20</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA21</name>
          <description>PMECC Error Location SIGMA 21 Register</description>
          <addressOffset>0x0000057C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA21</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA22</name>
          <description>PMECC Error Location SIGMA 22 Register</description>
          <addressOffset>0x00000580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA22</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA23</name>
          <description>PMECC Error Location SIGMA 23 Register</description>
          <addressOffset>0x00000584</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA23</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA24</name>
          <description>PMECC Error Location SIGMA 24 Register</description>
          <addressOffset>0x00000588</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGMA24</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>24</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-23</dimIndex>
          <name>ERRLOC[%s]</name>
          <description>PMECC Error Location 0 Register</description>
          <addressOffset>0x0000058C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRLOCN</name>
              <description>Error Position within the Set {sector area, spare area}</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
